app/controllers/noticias_controller.rb

    def index
      @noticias=Noticia.all
---
SELECT "noticias".* FROM "noticias"

    def create
      @noticia = Noticia.new(noticia_params)
      if @noticia.save
---
INSERT INTO "noticias" ("titulo", "descripcion", "informacion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["titulo", "dia del niño"], ["descripcion", "ksfjkdjf"], ["informacion", "ldkjflsdkglskglfd"], ["created_at", "2020-10-03 21:42:55.733077"], ["updated_at", "2020-10-03 21:42:55.733077"]]

    def update
      if @noticia.update(noticia_params)
---
UPDATE "noticias" SET "descripcion" = ?, "updated_at" = ? WHERE "noticias"."id" = ?  [["descripcion", "Un dia muy especial para las madres"], ["updated_at", "2020-10-04 15:48:59.509836"], ["id", 8]]

    def destroy
      @noticia.destroy
---
DELETE FROM "noticias" WHERE "noticias"."id" = ?  [["id", 1]]

    def set_noticia
      @noticia = Noticia.find(params[:id])
---
SELECT "noticias".* FROM "noticias" WHERE "noticias"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]